import LineSplitter from "@/components/LineSpliter";
import CompanySlider from "@/components/CompanySlider";
import { Box, Container, Typography } from "@mui/material";
import ProductPart from "@/components/dubai/ProductPart";
import { getSites } from "@/services/Dubai";

const description =
	"تا حالا شده یکی از محصول های  نایک یا امازون یا ادیداس و ... ببینی و عین اون محصول رو بخوای نه فیک یا کپیشو\nاگر بخوای به صورت مستقیم از سایت خودشون درخواست کنی میدونی چقد هزینه و دردسرش زیاد میشه؟\nتازه ممکنه تا به دستت برسه دیگه کاملا از مد افتاده باشه و از دله توهم بیوفته \nاما حالا ، حاله دله تو برامون مهمه و این فرایند رو برات ساده کردیم\nاگر از هر محصولی از سایت هایی که ما پشتیبانی میکنیم خوشت بیاد میتونی به ما درخواست بدی تا همون رو برات بیاریم و تحویلت بدیم اصلا مهم نیست که چیه و چه اندازه اس\nتوی گیزمو هیچ محدودیتی وجود نداره\nبا کمترین زمان و بهترین قیمت هرچیزی رو که بخوای \nحالا چطور؟؟ بیا فرض کنیم‌ میخوای از سایت ادیداس خرید کنی تمامه کاری که باید بکنی اینه که بری توی سایت ادیداسو بری توی صفحه محصولی که میخوای و لینکش رو کپی کنیو بعد بیای و توی باکس بالا لینک رو بزای و فقط ۳۰ ثانیه منتطر بمونی تا ما محصول رو استعلام کنیموقتی که مشخصات محصول اومد اون رو تایید میکنی و درخواستت رو برای ما میفرستیو ادامه کار رو به ما میسپاری.\nاگر نتیجه فرایند با خطا مواجه شد شاید لینک رو اشتباه برداشتی یا توی راه اسیب دیده لطفا با توجه به راهنمایی بالا دوباره چک کن  و از صحت لینک مطمعن شوحواست باشه که لینکت حتما باید برای صفحه اون محصوله مورد نطرت باشه \nو اگر مطمعن شدی ولی بازم خطا داشتی ، بعد از یه مدتی دوباره تلاش کن \nخرید خوبی داشته باشی دوسته من";

const DubaiPage = async () => {
	const brandsList = await getSites();

	return (
		<>
			<Box>
				<LineSplitter text={"خرید از دبی"} />
				<ProductPart />
				<LineSplitter text={"توضیحات"} />
				<Container maxWidth="xl">
					<Typography
						mt={3}
						align="justify"
						px={2}>
						{" "}
						تا حالا شده یکی از محصول های نایک یا امازون یا ادیداس و ... ببینی و
						عین اون محصول رو بخوای نه فیک یا کپیشو اگر بخوای به صورت مستقیم از
						سایت خودشون درخواست کنی میدونی چقد هزینه و دردسرش زیاد میشه؟ تازه
						ممکنه تا به دستت برسه دیگه کاملا از مد افتاده باشه و از دله توهم
						بیوفته.
					</Typography>
					<Typography
						mt={3}
						align="justify"
						px={2}>
						{" "}
						اما حالا ، حاله دله تو برامون مهمه و این فرایند رو برات ساده کردیم
						اگر از هر محصولی از سایت هایی که ما پشتیبانی میکنیم خوشت بیاد میتونی
						به ما درخواست بدی تا همون رو برات بیاریم و تحویلت بدیم اصلا مهم نیست
						که چیه و چه اندازه اس.{" "}
					</Typography>
					<Typography
						sx={{ fontWeight: "bold" }}
						mt={3}
						align="justify"
						px={2}>
						{" "}
						توی گیزمو هیچ محدودیتی وجود نداره با کمترین زمان و بهترین قیمت
						هرچیزی رو که بخوای.{" "}
					</Typography>
					<Typography
						mt={3}
						align="justify"
						px={2}>
						{" "}
						حالا چطور؟؟ بیا فرض کنیم‌ میخوای از سایت ادیداس خرید کنی تمامه کاری
						که باید بکنی اینه که بری توی سایت ادیداسو بری توی صفحه محصولی که
						میخوای و لینکش رو کپی کنیو بعد بیای و توی باکس بالا لینک رو بزای و
						فقط ۳۰ ثانیه منتطر بمونی تا ما محصول رو استعلام کنیموقتی که مشخصات
						محصول اومد اون رو تایید میکنی و درخواستت رو برای ما میفرستیو ادامه
						کار رو به ما میسپاری.{" "}
					</Typography>
					<Typography
						mt={3}
						align="justify"
						px={2}>
						{" "}
						.اگر نتیجه فرایند با خطا مواجه شد شاید لینک رو اشتباه برداشتی یا توی
						راه اسیب دیده لطفا با توجه به راهنمایی بالا دوباره چک کن و از صحت
						لینک مطمئن شوحواست باشه که لینکت حتما باید برای صفحه اون محصوله مورد
						نظرت باشه{" "}
					</Typography>
					<Typography
						mt={3}
						align="justify"
						px={2}>
						{" "}
						.و اگر مطمئن شدی ولی بازم خطا داشتی ، بعد از یه مدتی دوباره تلاش کن{" "}
					</Typography>
					<Typography
						mt={3}
						align="justify"
						px={2}>
						{" "}
						خرید خوبی داشته باشی دوسته من !{" "}
					</Typography>
				</Container>
				<LineSplitter text={"سایت های قابل سفارش"} />
				<CompanySlider
					hasSecondPart={true}
					brands={brandsList}
					itemsPerPage={5}
					swapTime_millisecond={3000}
				/>
			</Box>
		</>
	);
};

export default DubaiPage;
