import LineSplitter from "@/components/LineSpliter";
import CompanySlider from "@/components/CompanySlider";
import { Box, Container, Typography } from "@mui/material";
import ProductPart from "@/components/dubai/ProductPart";
import { getSites } from "@/services/Dubai";

const description =
	"لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.";

const DubaiPage = async () => {
	const brandsList = await getSites();

	return (
		<>
			<Box>
				<LineSplitter text={"خرید از دبی"} />
				<ProductPart />
				<LineSplitter text={"توضیحات"} />
				<Container maxWidth="xl">
					<Typography
						mt={3}
						align="justify"
						px={2}>
						{description}
					</Typography>
				</Container>
				<LineSplitter text={"سایت های قابل سفارش"} />
				<CompanySlider
					hasSecondPart={true}
					brands={brandsList}
					itemsPerPage={5}
					swapTime_millisecond={3000}
				/>
			</Box>
		</>
	);
};

export default DubaiPage;
